#Combining Dataframes together


1.   Merging
2.   Joining
3.Concatenating

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#Concatenation

In [8]:
pd.concat([df1 , df2 , df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1 , df2 , df3] , axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#Pandas - Operation

In [10]:
df = pd.DataFrame({'Col1':[1,2,3,4],
                   'Col2':[44,55,66,55],
                   'Col3':['a','b','c','d']
                   })

In [11]:
df

   Col1  Col2 Col3
0     1    44    a
1     2    55    b
2     3    66    c
3     4    55    d

In [12]:
#df.head(), df.tail()

df.head()

   Col1  Col2 Col3
0     1    44    a
1     2    55    b
2     3    66    c
3     4    55    d

In [13]:
df.tail()

   Col1  Col2 Col3
0     1    44    a
1     2    55    b
2     3    66    c
3     4    55    d

In [14]:
#unique values

df['Col2'].unique()

array([44, 55, 66])

In [15]:
df['Col2'].nunique()

3

In [16]:
df['Col2'].value_counts()

55    2
66    1
44    1
Name: Col2, dtype: int64

#applying Functions

In [17]:
def square(x):
  return x*x

In [21]:
df['Col1'] = df['Col1'].apply(square)

In [19]:
df['Col3'].apply(len)

0    1
1    1
2    1
3    1
Name: Col3, dtype: int64

In [22]:
df['Col1'].sum()

30

In [23]:
#removing a column

del df['Col3']

In [24]:
df

   Col1  Col2
0     1    44
1     4    55
2     9    66
3    16    55

In [25]:
#getting all columns

df.columns

Index(['Col1', 'Col2'], dtype='object')

In [26]:
#getting all indices

df.index

RangeIndex(start=0, stop=4, step=1)